[{"by":"burntwater","id":16963601,"parent":16962078,"retrieved_on":1528401048,"text":"The New York State fee by itself is $200. Unless I&#x27;m missing something, you paid significantly more than that for the publication requirement (it was around $1,000, give or take a couple hundred, last I checked).","time":1525132803,"type":"comment"},
{"by":"sswaner","id":16963602,"kids":[16964110],"parent":16962984,"retrieved_on":1528401048,"text":"Where in the article is the allegation or assertion of invention?  Wittgenstein was focused on the philosophy of language (see Tractatus, Philsophical Investigations, the brown book, etc).  I would be interested in hearing your opinion on who contributed more to the philosophy of language.  I didn&#x27;t mind spending multiple semesters studying  Wittgenstein - in fact, it has provided some of the most lasting impact over the many years since college.<p>Also, not all philosophy is logic.","time":1525132825,"type":"comment"},
{"by":"cglee","id":16963603,"kids":[16964891],"parent":16961716,"retrieved_on":1528401048,"text":"This is something we spend a lot of time thinking about at Launch School. You need the right pedagogy for the right phase of learning (<a href=\"https:&#x2F;&#x2F;launchschool.com&#x2F;pedagogy\" rel=\"nofollow\">https:&#x2F;&#x2F;launchschool.com&#x2F;pedagogy<\/a>).<p>Most article writers aren&#x27;t differentiating their audience enough, making their articles difficult to read for most people. There is a huge variance of &quot;beginners&quot;, for example. Further, most developers who write these articles don&#x27;t have a holistic learning framework in mind. Lastly, I&#x27;m seeing far too many technical tutorials just for SEO or attracting eyeballs lately. These articles are great for attracting attention but are typically technically shallow and add to the confusion rather than help.","time":1525132827,"type":"comment"},
{"by":"carlhjerpe","id":16963604,"parent":16963345,"retrieved_on":1528401048,"text":"It&#x27;s hard to defend something like this, but i think it&#x27;s important to know that this only affects MikroTik devices with the SMB service enabled (disabled by default).<p>It&#x27;s very bad, but they responded quickly and resolved the issue.<p>One thing i&#x27;d say is worth mentioning is that they&#x27;re still keeping &quot;all&quot; (all i know off) RouterBoard devices updated. We&#x27;ve had customers with gear many many years old, still updated with feature and security upgrades.","time":1525132831,"type":"comment"},
{"by":"lobo_tuerto","descendants":1,"id":16963605,"kids":[16963652],"retrieved_on":1528401048,"score":4,"time":1525132843,"title":"How to Rewire Your Brain--And Vision","type":"story","url":"https:\/\/www.psychologytoday.com\/us\/blog\/eyes-the-brain\/200904\/how-rewire-your-brain-and-vision"},
{"by":"choumalion","dead":true,"id":16963606,"retrieved_on":1528401049,"score":1,"time":1525132868,"title":"أقوى فيلم اكشن لسنة 2018 'ولد ليقاتل' مترجم و بجودة عالية","type":"story","url":"http:\/\/ifada1.ahlamontada.com\/t3605-topic#.WueuITKOmnI.hackernews"},
{"by":"mikeryan","id":16963607,"parent":16963028,"retrieved_on":1528401049,"text":"Normally I’m pro simple answers but I think this answer over simplifies a bit too far. When it comes to allocating state revenue just having a presence in a state doesn’t mean as much as “where services are performed” or products sold. It’s a heck of a dance dealing with these issues some tax time.","time":1525132886,"type":"comment"},
{"by":"yodon","id":16963608,"kids":[16966314],"parent":16962948,"retrieved_on":1528401049,"text":"(Retyped is part of the Bridge.NET C# -&gt; JS&#x2F;TypeScript converter)<p>It’s super exciting too see Bridge maintaining its place in a world that includes both C# -&gt; WebAsm and mature TypeScript ecosystems.<p>I’d started to wonder if Bridge still had a role to play now that those two ecosystems are maturing, but I think the marshalling cost between WebAsm and JS&#x2F;Dom is likely to discourage full WebAsm implementations in many cases, and if it does the ability to do seamless code sharing between frontend TypeScript and backend C# is pretty killer.","time":1525132905,"type":"comment"},
{"by":"mannykannot","id":16963609,"parent":16963467,"retrieved_on":1528401049,"text":"If you are doing research, you cannot, by definition, put a firm value on it beforehand. At best, with applied research, you can estimate a loose upper bound in the case of it being successful. Without exploratory science, we would not even have the basis to make hypotheses.","time":1525132911,"type":"comment"},
{"by":"Caprinicus","id":16963610,"kids":[16963697],"parent":16962203,"retrieved_on":1528401049,"text":"And that they grew to this point before imposing this &quot;curation&quot;. It seems to be a recurring theme with these companies to grow to a monopoly with a place for relatively free discourse and then to do this as soon as they feel safe.","time":1525132915,"type":"comment"},
{"by":"AnimalMuppet","id":16963611,"parent":16962923,"retrieved_on":1528401049,"text":"But for embedded software, ABI-specific isn&#x27;t (usually) an issue.  I have <i>never<\/i> seen an embedded project that changed either architectures ore compilers in the middle.  In embedded, once you start the project, you&#x27;re almost always using the same tooling until it dies.  (Even moving to the latest rev of a compiler is rarely done, in my experience.)<p>So you can use bitfields, however they have to be defined to work with your compiler&#x2F;architecture&#x2F;hardware, and expect that they&#x27;re going to continue to work for the duration.  (Whether bitfields are a bad idea for <i>other<\/i> reasons is outside the scope of my comment.)","time":1525132930,"type":"comment"},
{"by":"tripletao","id":16963612,"parent":16960378,"retrieved_on":1528401049,"text":"&gt; So Recylers get thousands of systems annually that are perfectly serviceable, fully licensed with windows but they can not use that license because there is no restore CD and they have no way to obtain one. Thus MS does them a &quot;favor&quot; buy selling them a new license for $25 instead of just providing a way for them to restore the system<p>Then why don&#x27;t the recyclers just get one restore CD and make copies? They could save almost $25&#x2F;system....","time":1525132935,"type":"comment"},
{"by":"shabble","id":16963613,"parent":16962671,"retrieved_on":1528401049,"text":"I&#x27;m thinking of a number between 1 and 100.<p>It&#x27;s bcrypt hash is:\n    &#x27;$2b$15$qUxzZ5ZF55lMuqiH9GMjQOHkNyee86qd2Vh2kQyF5P3U6JZJx9AEC&#x27;<p>I bet nobody could ever reverse this secure cryptographic hash to figure out what it could be... ;)","time":1525132940,"type":"comment"},
{"by":"eecsninja","id":16963614,"kids":[16963644],"parent":16963465,"retrieved_on":1528401050,"text":"The solution is just to make sure you have padding fields that result in an overall size that&#x27;s a multiple of however many bits e.g. 32 or 64 bits. Use static_assert() to enforce the size.<p>See my earlier comment about unit testing too.","time":1525132947,"type":"comment"},
{"by":"patio11","id":16963615,"kids":[16964954],"parent":16962951,"retrieved_on":1528401050,"text":"It doesn&#x27;t, but we help people get them on an ad hoc basis.<p>Mind if I make a guess? You&#x27;re probably wondering &quot;Can I get a DUNS number so that I can list something on the App Store?&quot; if you&#x27;re like 90% of people who ask us this. If so, let me just tell you now what we&#x27;d tell you in the future:<p>&gt; My most recent understanding is that if they’re using the DUNS number as a part of the Apple Developer program,  we should recommend that they email appdeveloper@dnb.com and they will advise you how to apply for your situation. Just let them know that you’re representing a US company trying to get a DUNS number but that you’re headquartered in [country outside of the US if that’s an additional consideration].","time":1525132955,"type":"comment"},
{"by":"rhizome","id":16963616,"kids":[16963671],"parent":16963467,"retrieved_on":1528401050,"text":"Basic research never makes a good case for being a profit center.","time":1525132988,"type":"comment"},
{"by":"xrange","id":16963617,"parent":16962457,"retrieved_on":1528401050,"text":"&gt; red state prisons sit full of petty dime bag dealers<p>Does anyone know where to get at the raw statistics for this kind of information?  So that we can figure out how many prisoners there are in red states vs. blue states for marijuana possession?","time":1525132995,"type":"comment"},
{"by":"smsm42","id":16963618,"kids":[16964829],"parent":16959371,"retrieved_on":1528401050,"text":"Wait so Twitter allows corporations to access and search <i>public<\/i> tweets, which are <i>published<\/i> by people so that they can be seen <i>publicly<\/i>? Oh the humanity!<p>Next thing we&#x27;ll learn some company is indexing public websites and allows people to search in those too!","time":1525133008,"type":"comment"},
{"by":"dfox","id":16963619,"parent":16962096,"retrieved_on":1528401050,"text":"As for the solaris it is probably only UNIX where ignoring the ISO C rule that anything ending with &quot;_t&quot; is reserved for implementation will bite you hard as solaris&#x27; libc headers are probably the main reason for that and typedef stuff like lock_t.<p>As for the rest doing cycle exact emulation of 50 year old system is and probably always will be doable and from some PoV trivial: you can just simulate the hardware logic of the original implementation on RTL or even gate level and it still will be faster than realtime.<p>[Edit: &quot;reserved for implementation&quot; was missing from the first paragraph]","time":1525133028,"type":"comment"},
{"by":"forkandwait","id":16963620,"parent":16959433,"retrieved_on":1528401050,"text":"<a href=\"https:&#x2F;&#x2F;plato.stanford.edu&#x2F;entries&#x2F;feyerabend&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;plato.stanford.edu&#x2F;entries&#x2F;feyerabend&#x2F;<\/a>","time":1525133036,"type":"comment"},
{"by":"sevensor","id":16963621,"parent":16961276,"retrieved_on":1528401051,"text":"My kids play with the neighbor kids.  They run up and down a whole bunch of contiguous backyards and ride bikes in the front.  Everybody plays with everybody else&#x27;s stuff.  I wish I could share the secret to making that happen, but it just happened on its own.  The kids decided to play with each other.","time":1525133086,"type":"comment"},
{"by":"s73v3r_","id":16963622,"parent":16963542,"retrieved_on":1528401051,"text":"I don&#x27;t believe the entire load is anywhere near there, then. Also, for a lot of these things, once you have the procedures in place, maintaining compliance does not take much effort.","time":1525133088,"type":"comment"},
{"by":"megy","id":16963623,"kids":[16963850],"parent":16957233,"retrieved_on":1528401051,"text":"&gt; - Involves huge Mechs and giant city-sized bugs (the word mech is literally written on the screenshot)<p>&gt;- Is turn-based<p>&gt;- You have a number of units.<p>&gt;- These bugs are doing something bad to the cities and tanks.<p>&gt;- Things are exciting and literally on fire<p>&gt;- The kind of tile you are standing on has a tactical effect (advance wars-style)<p>&gt;- It&#x27;s science fiction and involves TIME PODS (also literally written on the screen, these guys are geniuses)<p>I get none of this from the screenshot, it looks like a huge mess","time":1525133094,"type":"comment"},
{"by":"smsm42","id":16963624,"kids":[16964826],"parent":16960015,"retrieved_on":1528401051,"text":"I&#x27;m not sure what un-obvious implications are there? That if you write something on the Internet in public service, people could read it? Isn&#x27;t that the whole point of publishing it?","time":1525133095,"type":"comment"},
{"by":"walshemj","id":16963625,"parent":16962215,"retrieved_on":1528401051,"text":"But the % of former blue collar workers who have the interest and can go though the academic requirements is small (and most of that cohort today go to Uni).<p>For example the requirements to go on my technician course in the UK back in the day  required 6 O levels (exams taken at 16) for the Bank only 4. Ok it was a specialized for the local industry themo fluids one.","time":1525133132,"type":"comment"},
{"by":"omio","id":16963626,"parent":16962794,"retrieved_on":1528401051,"text":"About a decade ago I found this out the hard way... Damn dog missed over a hundred pounds of HE under its nose.","time":1525133135,"type":"comment"},
{"by":"hkon","id":16963627,"parent":16961359,"retrieved_on":1528401051,"text":"The formatting of that text is actually making me dizzy. Weird","time":1525133151,"type":"comment"},
{"by":"dawhizkid","id":16963628,"parent":16961625,"retrieved_on":1528401051,"text":"My curiosity about nootropics was the only reason I bought Bitcoin in 2014 so I could buy them online.","time":1525133153,"type":"comment"},
{"by":"Sohcahtoa82","id":16963629,"parent":16963407,"retrieved_on":1528401052,"text":"Seriously.<p>The article is titled in such a way to incite negative opinions of Uber drivers.  Replace &quot;uber driver&quot; with any other job title and you could imply that any profession has a high rate of sexual abusers.","time":1525133154,"type":"comment"},
{"by":"grzm","descendants":0,"id":16963630,"retrieved_on":1528401052,"score":3,"time":1525133170,"title":"Whatever happened to Semantic Web?","type":"story","url":"https:\/\/joelkuiper.eu\/semantic-web"},
{"by":"kazinator","id":16963631,"parent":16961549,"retrieved_on":1528401052,"text":"In TXR Lisp&#x27;s FFI, I developed detailed support for bitfields, alignment and packing. You can comply with any kind of struct type no matter how it&#x27;s declared.<p>In the reference manual, I added a section on what I believe are the bitfield allocation rules used by GCC, as I empirically reverse engineered them.<p><a href=\"https:&#x2F;&#x2F;www.nongnu.org&#x2F;txr&#x2F;txr-manpage.html#N-027D075C\" rel=\"nofollow\">https:&#x2F;&#x2F;www.nongnu.org&#x2F;txr&#x2F;txr-manpage.html#N-027D075C<\/a><p>Hope someone finds it useful.<p>Endian considerations are not covered in that section because that topic is documented elsewhere in the document.<p>In a nutshell, on big endian, bitfields are packed from the most significant end of the storage word, and on little endian, from the least significant end of the storage word. Thus the lowest addressed byte of the storage unit is filled first, and so on.","time":1525133240,"type":"comment"},
{"by":"a_d","id":16963632,"kids":[16963954],"parent":16962328,"retrieved_on":1528401052,"text":"If true, and still a big if, since the journalist seems to be conjecturing -- this might have implications for Facebook&#x27;s future acquisitions.<p>Acquiring social networks that get to scale is an integral part of Zuck&#x27;s strategy. It is a fairly smart strategy since one company cannot successfully lead or copy all the innovation - and social networks are very &quot;taste-dependent&quot; products. Zuck understands that Facebook is a big incumbent, and as with any incumbent there would be &#x27;anti-incumbent&#x27; products. He was just willing to buy these products without too much fuss.<p>His willingness to overpay for these companies has been a part of a long-term dominance strategy. Maybe he has one or two misses like Snap; but by and large, his sense for &quot;pricing&quot; these companies and a no-nonsense &quot;Corp Dev&quot; approach could be thought of as a competitive advantage (plus he has proven that he can do it repeatably). The lawyers don&#x27;t get involved until much later - he &quot;leads&quot; from the front when doing these deals. It is not very common in large-company-land.<p>If Jan Koum, who is very highly respected (he is truly a no-bullshit product&#x2F;management person) leaves for the &quot;wrong&quot; reasons, it might have long-term implications for other companies that Zuck wants to buy in the future. Thus leaving an opening in the market for an &#x27;anti-incumbent&#x27; offering to thrive.","time":1525133254,"type":"comment"},
{"by":"DonaldFisk","id":16963633,"kids":[16963929,16964101,16964136],"parent":16963463,"retrieved_on":1528401052,"text":"50 years ago the WWW didn&#x27;t exist and there was no such thing as a servlet.<p>The system ran on a mainframe not 50 but 60 years ago.   The only high level language at the time was FORTRAN, but this system was apparently written in assembly language.<p>Does anyone know the type of computer it ran on?   The article  it linked to says IBM mainframe but which model?","time":1525133255,"type":"comment"},
{"by":"sjg007","id":16963634,"kids":[16963987],"parent":16962840,"retrieved_on":1528401052,"text":"Yes but not good for your testicles.","time":1525133266,"type":"comment"},
{"by":"geofft","id":16963635,"parent":16962349,"retrieved_on":1528401053,"text":"&quot;I have social connections and support structures in California&quot; sounds like a pretty good reason to me. Starting a business, paying extra taxes, and being willing to stick with it for the long term sounds better than being lonely and giving up 6 months in or deciding not to start it at all.","time":1525133282,"type":"comment"},
{"by":"FridgeSeal","id":16963636,"parent":16962430,"retrieved_on":1528401053,"text":"&gt; but have probably been trained not to care.<p>I&#x27;m of the opinion that this is definitely something that has occurred and it has been done very, very deliberately. The media and ad industry and companies like fb work(ed) very hard to encourage people that:<p>* they should give up privacy in return for (carefully metered out dopamine hits) shiny things.<p>* they should give up more data and privacy because they&#x27;ve given up x much already<p>* They&#x27;ve given up all this stuff, fb&#x2F;et etc already knows everything so they don&#x27;t have any privacy so why bother protecting stuff _now_<p>* They gave up all this stuff and look, nothing bad has happened, so if you want privacy, you must be hiding something&#x2F;a terrorist&#x2F;a paedophile&#x2F;etc.<p>And thus we arrive where we are now. Trying to convince people to take back some privacy and control to un-fuck the whole situation is an uphill battle, because those whose interests are in retaining control and lack of privacy are very well resourced and have gone to great effort to hide negative effects from the users and convince them of their non-existence.","time":1525133283,"type":"comment"},
{"by":"gowld","id":16963637,"parent":16963274,"retrieved_on":1528401053,"text":"Testing is invasive and expensive, and any part of your body could become cancerous. Would you like a colonoscopy twice a year? All your moles biopsied twice a year? Mammograms and MRI twice a year?","time":1525133304,"type":"comment"},
{"by":"thijsvandien","id":16963638,"parent":16962277,"retrieved_on":1528401053,"text":"It does not entirely beat the purpose of a salt, because still the existence of a rainbow table for that particular combination of algorithm and salt is a lot less likely than for the algorithm unsalted.<p>As for your question, a solution could be to allow the account at first and perform regular checks in the background. It won&#x27;t make a big difference if the account is never created or deleted within 10 minutes. In fact, the latter could be better, because it will be harder to check for any outsider (including the offender) whether an address is blocked, which is good for privacy and helps keep the offender busy, because they can&#x27;t use a different address right way—they first spend some time in vain.","time":1525133311,"type":"comment"},
{"by":"smsm42","id":16963639,"parent":16961956,"retrieved_on":1528401053,"text":"I understand how this can be frustrating, but it is not true that you didn&#x27;t do anything to deserve this. You published several comments with high noise-to-content ration (and yes, complaining about downvotes is also noise). You got downvotes for that. Take them, move on and do better next time. It&#x27;s just bits on some server, and they mean nothing except showing you how to improve your participation on the site.","time":1525133322,"type":"comment"},
{"by":"xapata","id":16963640,"parent":16957645,"retrieved_on":1528401053,"text":"Or it could go the other way. No one is sure what happens if the major currents change. Northern Europe should probably get ready for a cold spell.","time":1525133326,"type":"comment"},
{"by":"girzel","id":16963641,"kids":[16964366],"parent":16961726,"retrieved_on":1528401053,"text":"My understanding is that bike-share companies in China (unlike how they operate in the US) require a deposit when you sign up for an account. Everybody dumped 100 RMB or what have you into their accounts at the outset<p>Meaning that starting a company like this is essentially a scheme for scamming a massive infusion of liquidity: you raise funds, collect deposits, and then you either decamp for the Bahamas, or you invest your cash in the stock market and let the bikes rot.<p>We were surprised, upon moving back to the US, that the bike-share companies here don&#x27;t charge a deposit.","time":1525133327,"type":"comment"},
{"by":"eecsninja","id":16963642,"parent":16962410,"retrieved_on":1528401054,"text":"Did you forget to include field width specifiers?","time":1525133336,"type":"comment"},
{"by":"s73v3r_","id":16963643,"kids":[16964369],"parent":16962865,"retrieved_on":1528401054,"text":"&quot;I just gave you examples of voluntary interactions that are now illegal under the GDPR programme, and you respond that none of the examples reduce the range of voluntary interactions. It&#x27;s bizarre.&quot;<p>No, you didn&#x27;t. You gave a list of one-sided transactions where the user has no freedom or really consent at all in the matter.<p>&quot;My problem is the many limitations on the range of voluntary interactions that two parties can enter into that are found in the GDPR, a few of which I listed, and which you totally ignored.&quot;<p>No, you didn&#x27;t. All you did was post a list of &quot;transactions&quot; where the company has all the say, and the user really has no input whatsoever. No one is going to miss those transactions.<p>If you truly, honestly are concerned with &quot;consent&quot;, then you should be applauding this law, as it does require actual, informed, affirmative consent. Not the &quot;Here&#x27;s a great wall of text, agree to give us every little bit of data with no recourse whatsoever for you or don&#x27;t get any access to the service at all&quot; form of &quot;consent&quot;.<p>I&#x27;m sorry, but I cannot take seriously the idea that &quot;if you can&#x27;t sell yourself into slavery, you aren&#x27;t free&quot;.","time":1525133340,"type":"comment"},
{"by":"jcranmer","id":16963644,"kids":[16963668],"parent":16963614,"retrieved_on":1528401054,"text":"Well, to have a good chance of avoiding the landmines, you need to:<p>* Pack the bitfields in a struct all by themselves. Don&#x27;t mix bitfields and non-bitfields in the same struct. (This means that you limit the scope of insanity to other bitfields, not potentially expanding it to other regular fields).<p>* Make sure that the underlying type of all the bitfields within the struct have the same type. And make it be unsigned.<p>* Pad the bitfields to the appropriate size of the type.<p>* Only access the bitfields by copying them to&#x2F;from the appropriate local variable (you don&#x27;t want to trip code up on the bitfields-aren&#x27;t-quite-the-type-they-say-they-are logic).","time":1525133351,"type":"comment"},
{"by":"tropo","id":16963645,"parent":16957526,"retrieved_on":1528401054,"text":"This is .000018 inches off of the lake each day.<p>Per year, it is .0066 inches. That is about 1&#x2F;6 of a millimeter.<p>At that rate, the lake contains 508198 years worth of water. Thinking in terms of human evolution here... that is a decent chunk of time.<p>This supposed problem is all FUD, based on big scary numbers. Somebody has a motive to spread this. For example, a country that wants the industry might encourage opposition in the USA.","time":1525133387,"type":"comment"},
{"by":"abhgh","id":16963646,"kids":[16966116],"parent":16963478,"retrieved_on":1528401054,"text":"I think one of the challenges with using CD in the real world is the &quot;unclean&quot; input that need to be mapped to the various primitives and structures of CD, or stuff in the same vein that came after. Without a way to do that automatically, in a scalable fashion and with minimal human assistance, its utility is limited. Which is why I feel that if we had a way to leverage the current breed of ML techniques to automatically (or even semi-automatically) define this mapping, it would be a big step forward.","time":1525133390,"type":"comment"},
{"by":"samlents","id":16963647,"kids":[16966814],"parent":16963533,"retrieved_on":1528401054,"text":"Having not worked on large scale systems like what I imagine they must be working with, is this really true? I would have thought that a modern framework would make things easier. I&#x27;ve certainly had life made easier by modern web frameworks like React and Angular, although the support timeline is more on the order of 2-3 years, rather than 20-30.","time":1525133394,"type":"comment"},
{"by":"thomble","id":16963648,"parent":16962583,"retrieved_on":1528401054,"text":"&quot;Connecting the world&quot; to our lucrative public manipulation platform. I&#x27;m sick of the phrase.","time":1525133417,"type":"comment"},
{"by":"chiph","id":16963649,"parent":16963533,"retrieved_on":1528401054,"text":"Make sure you&#x27;re including <i>all<\/i> the lines, including those in libraries&#x2F;frameworks you reference. Because they all count towards your MTBF.","time":1525133428,"type":"comment"},
{"by":"contingencies","id":16963650,"parent":16957873,"retrieved_on":1528401055,"text":"Some crystal balling: A lot of these alt-proteins are going to encounter distribution issues.<p>Why? People aren&#x27;t going to just go out and say &quot;hey, give me some tofurkey, I watched a PETA documentary last night&quot; and becoming hooked regular alt-protein consumers.<p>Also, given that in many other parts of the world (South America, Africa, India, China, Middle East) people just eat vegetables and don&#x27;t need to pretend it&#x27;s meat to enjoy them - lentils, chickpeas, soybeans&#x2F;tofu, nuts, seeds, etc. - in terms of health, production cost, familiarity, appearance and overall consumer acceptance, alt-protein faces an uphill battle outside of the new, growing, and high margin western meat replacement market ... but that market is capped, and the real profits for this industry lie in mass consumer acceptance, which will basically be defined by solid inroads in to megacities (most of which are in Asia). These markets could be exceptionally hard to win.","time":1525133479,"type":"comment"},
{"by":"mikeash","id":16963651,"parent":16962923,"retrieved_on":1528401055,"text":"ABI-specific means you can count on the behavior as long as you know the target hardware and OS. If you’re twiddling registers, it’s highly likely you know the target.","time":1525133485,"type":"comment"},
{"by":"Shikadi","id":16963652,"parent":16963605,"retrieved_on":1528401055,"text":"That&#x27;s actually pretty interesting, I didn&#x27;t know people could lack stereo vision, and even more I didn&#x27;t know the same people could get it with therapy. Kind of reminds me of that one camera connected to a blind person&#x27;s tongue experiment, where the brain sort of noticed optical signals and re-routed them to the vision parts of the brain. (Not a neuroscientist, I&#x27;m sure I said that wrong :P)","time":1525133486,"type":"comment"},
{"by":"samaysharma","descendants":0,"id":16963653,"retrieved_on":1528401055,"score":2,"time":1525133492,"title":"Apple Results to Show iPhone Growth Problem and Cook’s Plan to Fix It","type":"story","url":"https:\/\/www.bloomberg.com\/news\/articles\/2018-04-30\/apple-results-to-show-iphone-x-problem-and-cook-s-plan-to-fix-it"},
{"by":"monocasa","id":16963654,"kids":[16968981],"parent":16962869,"retrieved_on":1528401055,"text":"&gt; If a process has many threads, their stacks are all located within a single virtual address space corresponding to the user process?<p>Yep!<p>&gt; If one thread grows down and is about to overwrite the top of another thread&#x27;s stack, does the OS detect this automatically and do some sort of reallocation procedure?<p>The kernel reserves a 8MB region for each stack and that&#x27;s it (even the initial stack).  So you wouldn&#x27;t get overlapping stacks per se; the regions are preallocated.  The kernel does try to detect stack overflow&#x2F;underflow with guard pages, but that&#x27;s just a best attempt kind of thing, and of you underflow by more than page you can just end up just corrupting memory.<p>And all of this is for C&#x27;s sort of standard model.  &#x27;Split stacks&#x27; is a scheme closer to your second question, but there&#x27;s a lot of overhead of that model, and not a lot of runtimes use it.<p>I&#x27;ve also even more rarely seen a model that allocates stack frames on the heap and links them together in a linked list.<p>But like I said, these schemes are <i>very<\/i> in practice.","time":1525133502,"type":"comment"},
{"by":"mediawatch","id":16963655,"kids":[16963793],"parent":16963570,"retrieved_on":1528401055,"text":"This article is based on a study dating back to April 2017. <a href=\"https:&#x2F;&#x2F;itwire.com&#x2F;outsourcing&#x2F;78004-only-36-of-indian-engineers-can-write-compilable-code-study.html\" rel=\"nofollow\">https:&#x2F;&#x2F;itwire.com&#x2F;outsourcing&#x2F;78004-only-36-of-indian-engin...<\/a>","time":1525133504,"type":"comment"},
{"deleted":true,"id":16963656,"retrieved_on":1528401055,"time":1525133515,"type":"story"},
{"by":"gowld","id":16963657,"kids":[16963746],"parent":16963432,"retrieved_on":1528401056,"text":"I don&#x27;t know if Simone is a citizen or Permanent Resident in the US (if not, she should seek government support from her home nation), but anyone who is a citizen or Permanent Resident in the US is eligible for &gt;1yr of temporary Unemployment insurance, as well as Medicare (age 65), Medicaid, CHIP, and SNAP.","time":1525133556,"type":"comment"},
{"by":"sliken","id":16963658,"parent":16941242,"retrieved_on":1528401056,"text":"Ha, &quot;cheap&quot;.   Have you looked at the AMD+Intel hybrid CPU prices?  I don&#x27;t think either AMD or Intel is particularly interested in that being a price&#x2F;perf leader.  Especially from the AMD side who already sells zen CPUs with AMD GPUs inside.","time":1525133579,"type":"comment"},
{"by":"DonaldFisk","id":16963659,"kids":[16963698],"parent":16960876,"retrieved_on":1528401056,"text":"If the hardware is unsupported and no longer maintainable you could run the software on an emulator.   That way you don&#x27;t need to know how the software works.   The hardware&#x27;s instruction set would be a lot less complex and almost certainly better documented.","time":1525133584,"type":"comment"},
{"by":"SitePointdotcom","dead":true,"id":16963660,"retrieved_on":1528401056,"score":2,"time":1525133614,"title":"WP Crowdfunding: The Complete Solution for Fundraising Websites","type":"story","url":"https:\/\/www.sitepoint.com\/wp-crowdfunding-the-complete-solution-for-fundraising-websites\/"},
{"by":"anonytrary","id":16963661,"kids":[16965149],"parent":16956798,"retrieved_on":1528401056,"text":"&gt; pay speeding tickets to the state instead of personally to each person living on the street you sped on<p>Roads are usually state-owned property, whereas your personal information is your property, right? If Alice mishandles Bob&#x27;s property, why is Charlie getting paid for it?<p>&gt; There&#x27;s no concept in the GDPR that the violation only exists between the site and the users whose privacy it violated<p>Why not? The site-customer relationship is the only relevant one here. What prevents a profitable, large-scale data mining company from simply accepting the Max(4%,$20m) = 4% tax for mishandling data?<p>A $20m dollar fine would surely deter smaller actors, but the 4% fine doesn&#x27;t seem like a deterrent for large-scale data-mining operations, which can be incredibly lucrative. For example, if Facebook had the choice between <i>not<\/i> using the data and making $60b per year, versus using the data and making $90b - .04 x $30b, wouldn&#x27;t they accept the tax and continue using the data? If this is the case, I don&#x27;t see GDPR making a big difference if the highest-market-share companies can &quot;get away&quot; with paying the fee.<p>This would increase the gap of viable profit models between smaller and larger companies, at the sole benefit of the state, with little, if any, benefit for the victims (the users). Of course, I am assuming that there is no criminal penalty for noncompliance. The government might think: why impose a criminal penalty if the state can simply tax large corporations for the mountains of profit they are making off of insights from personal data?","time":1525133620,"type":"comment"},
{"by":"Sohcahtoa82","id":16963662,"kids":[16966667],"parent":16962248,"retrieved_on":1528401056,"text":"I have never heard of this.  And judging by other responses, nobody else has, either.<p>Are you sure you&#x27;re not confusing that with rerouting you based on traffic?  And that the extra driving was done to get around a traffic jam?<p>EDIT: Are you tapping the map while driving?\n<a href=\"https:&#x2F;&#x2F;productforums.google.com&#x2F;forum&#x2F;#!topic&#x2F;maps&#x2F;LqK7zqz6m28;context-place=topicsearchin&#x2F;maps&#x2F;category$3Agoogle-maps-mobile%7Csort:relevance%7Cspell:false\" rel=\"nofollow\">https:&#x2F;&#x2F;productforums.google.com&#x2F;forum&#x2F;#!topic&#x2F;maps&#x2F;LqK7zqz6...<\/a><p>Also, why are people using Google Maps instead of Waze for navigation?","time":1525133631,"type":"comment"},
{"by":"AnimalMuppet","id":16963663,"parent":16963291,"retrieved_on":1528401056,"text":"It seems to me that Newton <i>did<\/i> frame hypotheses.  The inverse square law is a hypothesis - a proposed explanation of phenomena (the orbits of the planets).  It&#x27;s just that Newton stopped there - he didn&#x27;t propose a hypothesis for why gravity follows an inverse square law.","time":1525133655,"type":"comment"},
{"by":"newnewpdro","id":16963664,"parent":16962011,"retrieved_on":1528401057,"text":"That this attracted police attention and became news of this magnitude is depressing.","time":1525133690,"type":"comment"},
{"by":"aphextron","id":16963665,"kids":[16963675,16963754],"parent":16963484,"retrieved_on":1528401057,"text":"Really confusing title with &quot;Facebooks&quot; missing an apostrophe","time":1525133692,"type":"comment"},
{"by":"startupdiscuss","id":16963666,"kids":[16971304,16964489,16964849,16968490],"parent":16961716,"retrieved_on":1528401057,"text":"I wish the authors — or any authors — studied which courses actually deliver results as opposed to what they ought to deliver.<p>For instance, immediate feedback ought to deliver learning. So they looked at which courses give immediate feedback.<p>But it would be even better if somone looked at which learners actually learned. You took the course now build xyz. Or pass a test or something.<p>There might be a difference in the sorts of “immediate feedback” that are effective. It’s an indirect proxy of what you are after.","time":1525133707,"type":"comment"},
{"by":"martin1975","id":16963667,"kids":[16963847],"parent":16963204,"retrieved_on":1528401057,"text":"not sure - I have an external Ubiquiti AP I use, plugged into the APU2&#x27;s ethernet port. You want wifi as part of the APU2 or separate?","time":1525133709,"type":"comment"},
{"by":"eecsninja","id":16963668,"kids":[16963957],"parent":16963644,"retrieved_on":1528401057,"text":"I&#x27;ve only used bitfields for register access. I get the first 3 points you make. (I use uint32_t for all fields)  What is the danger in #4 if you&#x27;ve followed #1-3?<p>You seem overly paranoid. Is there something from your experience that makes you nervous about bitfields?","time":1525133710,"type":"comment"},
{"by":"onetimemanytime","id":16963669,"kids":[16965296],"parent":16962328,"retrieved_on":1528401057,"text":"<i>&gt;&gt;“no one wakes up excited to see more advertising; no one goes to sleep thinking about the ads they’ll see tomorrow.”<\/i><p>Fair, but where did that $19 BILLION came from? $19B for a company making $20m a year","time":1525133719,"type":"comment"},
{"by":"aoeusnth1","id":16963670,"kids":[16964070],"parent":16963532,"retrieved_on":1528401057,"text":"And according to <a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Microlife\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Microlife<\/a> , the first 20 minutes of moderate exercise is worth 2 microlifes (or -2 micromorts).<p>At 15 miles&#x2F;hour, the means the first 5 miles of biking costs you about 0.25-0.5 micromorts of accident risk and gives you +2 microlifes of fitness.<p>Riding in a car, on the other hand, incurs accident risk AND has effects on fitness.","time":1525133722,"type":"comment"},
{"by":"kevhito","id":16963671,"parent":16963616,"retrieved_on":1528401057,"text":"Being charitable, I think the parent wasn&#x27;t saying it should be. But even in some fantasy ideal-government world, the budget is finite and zero-sum. By giving money to some fishing expedition with no clear expectation of any result, we are taking it from some other use.","time":1525133723,"type":"comment"},
{"by":"blattimwind","id":16963672,"kids":[16966277],"parent":16963495,"retrieved_on":1528401058,"text":"In IntelliJ you can refactor from UML views.","time":1525133733,"type":"comment"},
{"by":"sevensor","id":16963673,"parent":16962993,"retrieved_on":1528401058,"text":"I used pine from 1997-2004 or so.  By the end, emails were getting pretty unreadable because everyone else&#x27;s client was sending HTML.  I wasn&#x27;t savvy enough at the time to use lynx as a viewer.","time":1525133754,"type":"comment"},
{"by":"Barrin92","id":16963674,"parent":16963322,"retrieved_on":1528401058,"text":"And beta-blockers lower blood pressure, that doesn&#x27;t mean you should take them because someone on youtube tells you to. You should take drugs or supplements when a physician tells you that something is wrong that needs fixing.","time":1525133757,"type":"comment"},
{"by":"threeseed","id":16963675,"kids":[16963768],"parent":16963665,"retrieved_on":1528401058,"text":"Can we instead just have the original title: A Look at MyRocks Performance","time":1525133778,"type":"comment"},
{"by":"kw71","id":16963676,"parent":16963160,"retrieved_on":1528401058,"text":"I&#x27;ve been thinking about that too.  In Virginia we had a long-time sheriff who was a homosexual and for most of his office, homosexual acts were serious felonies.  He&#x27;d also been brought up on charges of kidnapping and some kind of attempted sodomy - while in office - but to deal with this they moved the trial to a rural town with an all white jury who would see the nonwhite victim in a predictable way.  So much for equally applicable protection of and liability to the laws.  Political patronage trumped the rule of law here.","time":1525133788,"type":"comment"},
{"by":"AnimalMuppet","id":16963677,"parent":16963540,"retrieved_on":1528401058,"text":"It might be an awful place to work.  Or it might just be, if I&#x27;m going to work at a place that has made several people billions of dollars, if I don&#x27;t get paid pretty well, I&#x27;m going to resent it.  They might have to pay well to keep morale up, not because it&#x27;s an awful place, but because it&#x27;s easy to envy others who also work there.","time":1525133801,"type":"comment"},
{"by":"AndrewKemendo","id":16963678,"kids":[16965820],"parent":16961863,"retrieved_on":1528401058,"text":"&gt;They&#x27;re comparing them to the performance of a person who is a native speaker of both of the languages in question.<p>Which is synonymous with the best translators in the world. Those people are relatively few and far between honestly - I&#x27;ve traveled a lot and I&#x27;d argue that native bi-lingual people are quite rare.","time":1525133802,"type":"comment"},
{"by":"jschwartzi","id":16963679,"parent":16962410,"retrieved_on":1528401059,"text":"I&#x27;ve seen this a lot in Texas Instruments&#x27; bare-metal BSPs for their processors that are generated using HalCoGen. Their own proprietary compiler handles them as you&#x27;d expect. Other BSPs typically follow the coding style for their operating system. I&#x27;ve never seen QNX BSP drivers use bitfields. I&#x27;ve also never seen them in Linux drivers. QNX and Linux typically use variants of GCC to compile their drivers unless you pay for another toolchain.","time":1525133805,"type":"comment"},
{"by":"Shikadi","id":16963680,"parent":16963330,"retrieved_on":1528401059,"text":"It was a general trend of the industry recently to put trash keyboards in all their laptops. I returned two laptops over it a few years ago, then got a lenovo because they were the only consistent choice at the time. That being said, they&#x27;ve gotten a little better, but I tried the apple keyboard recently and its atrocious in my opinion. Can&#x27;t possibly be good for your fingers. I&#x27;ve never been a fan of Apple, but a few years ago if you asked me whether or not they were solid quality I would have said definitely. Not so much any more.","time":1525133818,"type":"comment"},
{"by":"kwindla","id":16963681,"parent":16961222,"retrieved_on":1528401059,"text":"This exactly. &quot;Efficiency&quot; -- especially the way you measure it if you come from a small-company perspective -- is only one of many metrics. It feels like a really important one, but there&#x27;s some perspective distortion at work, in my personal experience as a small-company person who has interacted a lot with big company product teams, executives, and contracting departments.<p>Continuity matters much more than output-per-input-hour at large companies.<p>Here&#x27;s one way to look at it: big companies are large because they have big revenue streams to protect. Startups don&#x27;t. So the risk&#x2F;reward calculations look completely different. There&#x27;s lots of &quot;overhead&quot; in a big company that can fairly be characterized as &quot;systems that have evolved to protect the existing lines of business.&quot; For example, the political infighting at a Fortune 500 company over allocating $1M to new a new product R&amp;D project (as opposed to marketing, or maintenance of existing products, or internal IT spend) is shocking to a startup founder in Silicon Valley who is able to raise a $1M seed round to try out a &quot;good idea&quot; relatively quickly, these days. Why are VCs with $25M funds so much more willing to underwrite product development than Fortune 500 executives with billion-dollar P&amp;Ls? Because the VC&#x27;s downside is limited to $25M.<p>Here&#x27;s another way to look at it: you could define &quot;efficiency&quot; as &quot;how often does a company of a given size&quot; go out of business. By that measure, big companies are massively more efficient than small companies. Even factoring in the depredations of private equity investors. :-)<p>(This written by one of the above-mentioned startup founders who has struggled to get funding for new products from big company executives.)","time":1525133822,"type":"comment"},
{"by":"contingencies","id":16963682,"kids":[16964465],"parent":16959002,"retrieved_on":1528401059,"text":"I had the same realization in 2015 and doubled down.<p>We have just spent 2.5 years developing automated robotic systems for personalized food preparation, cooking, packaging and retail. Custom hot meals from your smartphone, ready in minutes, actually cooked from fresh ingredients, to personalized orders. Full nutrition breakdown. Model is a wholly owned and operated network, which lets us extract additional efficiencies from a modern logistics network. We simultaneously solve for convenience and choice (plus consistency and availability, with the option to compete effectively on cost if we choose). Series A opens in less than two weeks.","time":1525133862,"type":"comment"},
{"by":"gonnadoit05","dead":true,"id":16963683,"parent":16962683,"retrieved_on":1528401059,"text":"What’s a meaningful conversation look like to you?<p>Where do you find these conversations?","time":1525133866,"type":"comment"},
{"by":"wcunning","id":16963684,"kids":[16965202],"parent":16963208,"retrieved_on":1528401059,"text":"As in all engineering related choices, there are tradeoffs that make the decision between FPGAs and DSPs:<p>Similarities:<p>-&gt;Both are specialty items, with specialty dev. environments and proprietary libraries.<p>-&gt;Both are designed to do fast processing of highly parallel data (DSPs are known as VLIW processors, at least in all of the architectures I&#x27;m familiar with).<p>-&gt;Both require knowledgeable specialists to really get a whole lot of benefit from<p>Differences:<p>-&gt;DSPs were at a point in time much cheaper to build into a product, and sibling comment&#x27;s mention of the BeagleBone&#x27;s onboard resources reminds me that they were a big part of TI&#x27;s business once upon a time. Relatedly, they are often included in SoCs because they&#x27;re built using the same process node at the fab as the main ARM core. I&#x27;m not a silicon expert, so I&#x27;ll defer to someone else for confirmation of this, but my general understanding is that FPGAs have been built on different transistor designs and such to optimize the LUTs and their routing, causing them to be uneconomical to include in SoCs. Given that both Altera and Xilinx offer such things now, I&#x27;m not sure how current that statement is, but there is some amount of engineering tradeoff in the silicon layout itself.<p>-&gt;DSPs are still a processor, with a fixed layout, pipeline depth, etc. that all causes them to be optimal for certain sizes&#x2F;shapes of data. If your application doesn&#x27;t meet that, you might be better off with an FPGA.<p>-&gt;On the other hand, an FPGA is more easily scaled to weird data sizes... Do you have a 6 bit super high speed ADC? You very likely want to use an FPGA.<p>-&gt;FPGAs are pretty much the go-to choice when dealing with <i>really<\/i> high speed sampling. I&#x27;m not sure exactly where the line is drawn, but I&#x27;ve worked on a couple of medical imaging devices during internships that both used FPGAs to acquire the data, do some gentle massaging and packaging before offloading it to something else to do real image analysis, image processing, computer vision, etc.\n-&gt;A sub point to that, the resources on an FPGA that do that signal acquisition are pre-built blocks designed by the FPGA manufacturer and built in regular silicon, so they can acquire data at gigabit sampling rates. You can then apply place-and-route modifications to make sure that all processing of that data gets done on the LUT fabric as close to the signal acquisition point as possible to optimize timing, for example. This is the main area that FPGAs shine in.<p>-&gt;FPGAs have another interesting split: if you need to do complex verification of logic design, you might test on an FPGA and then build an ASIC. If, on the other hand, you&#x27;re only going to produce, say, 10 MRI machines a year at north of $10 million each, it might not be worth building a custom ASIC, so you just stick an <i>ultra<\/i> high end FPGA in as a daughter board to the rest of your design. (Read this as &quot;cost plays a major factor in picking FPGA vs. DSP&quot;)<p>Final closing thoughts:<p>The other major consideration between the two is who you can hire and what they know. A major portion of wireless devices (wifi routers, femtocells, etc.) uses a DSP to do the heavy lifting on the signal processing after the analog front end, so those companies have a lot of built in history, available example code, training for new engineers and an expectation that older engineers from a competitor will be used to that same technology. Medical device manufacturers, oscilloscope manufacturers, etc. have the opposite expectation since they&#x27;ve been using FPGAs for years. Once you&#x27;re used to paying a particular license fee to Xilinx for the IP Cores you just dropped into your design, you&#x27;re unlikely to be able to sell your boss on getting a bunch of custom code written by TI to make their DSP work as well, so you&#x27;ll be using what the tech stack already calls for.<p>(edit: formatting)","time":1525133874,"type":"comment"},
{"deleted":true,"id":16963685,"parent":16959433,"retrieved_on":1528401059,"time":1525133879,"type":"comment"},
{"by":"anonytrary","id":16963686,"kids":[16964187],"parent":16963572,"retrieved_on":1528401059,"text":"&gt; we&#x27;re punishing them because they decided they didn&#x27;t have to abide by the law at the time it existed.<p>Should we punish lawmakers for implementing oppressive laws which prevented good people from pursuing viable businesses? Why can&#x27;t there be accountability in the reverse direction?","time":1525133881,"type":"comment"},
{"by":"coffeemug","id":16963687,"kids":[16963844,16963946],"parent":16963467,"retrieved_on":1528401060,"text":"<i>&gt; There are a lot of good things to spend that money on, and if scientists want a piece of it they should provide a convincing justification.<\/i><p>But that&#x27;s not the right way to frame it. We have some amount of money to spend, and we need to figure out how to deploy it. We know that in aggregate basic research has resulted in astronomical payoffs over time. Therefore it&#x27;s in our interest to put money into basic research. It&#x27;s not the scientists who should provide convincing justification on why they deserve our money. It&#x27;s us who should provide convincing justification why more people should become scientists.","time":1525133890,"type":"comment"},
{"by":"ApolloRising","id":16963688,"parent":16951183,"retrieved_on":1528401060,"text":"This seems to help quite a few people a lot: <a href=\"http:&#x2F;&#x2F;www.habitbull.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.habitbull.com&#x2F;<\/a><p>It gives you a bit of a dopamine hit every time you check the box and really helps build good habits over time. The system is remarkably flexible for different kinds of habits.<p>(I am not the developer, just a happy customer)<p>One last thing, the best thing that seems to make a difference is to schedule your day hourly and maintain a rigid sleep&#x2F;wake&#x2F;exercise&#x2F;eating schedule. Don&#x27;t skip any of these and things will get better.<p>Mindfulness also seems to help but only if you practice it regularly, for ADHD folks that may mean scheduling a class and going to it every week to have the enforced practice.<p>Lastly, there is no quick fix, you are already motivated to get better since you asked the question; you now have to be motivated to be consistent and not let small failures make you give up.","time":1525133919,"type":"comment"},
{"by":"ghrifter","dead":true,"id":16963689,"parent":16960534,"retrieved_on":1528401060,"text":"lol markdown linking on HN","time":1525133937,"type":"comment"},
{"by":"gowld","id":16963690,"parent":16962011,"retrieved_on":1528401060,"text":"...which is not on the residential street with any responsible adults available.","time":1525133981,"type":"comment"},
{"by":"hinkley","id":16963691,"kids":[16964133,16964237,16963932,16965301,16968177,16977804],"parent":16963301,"retrieved_on":1528401060,"text":"Let’s say you figure out how to run a company with 100M customers with only five employees.<p>What stops me from getting together a few friends and stealing your business model?<p>At some point you have to add value just to keep the wolves at bay.","time":1525134019,"type":"comment"},
{"by":"threeseed","id":16963692,"kids":[16963755,16963750,16965277,16964284],"parent":16963484,"retrieved_on":1528401060,"text":"MySQL&#x27;s pluggable engine really is a killer feature.<p>From these results you would think it makes sense to have RocksDB the default for MySQL and then have InnoDB be there for the larger users.","time":1525134048,"type":"comment"},
{"by":"gowld","id":16963693,"parent":16961276,"retrieved_on":1528401060,"text":"You don&#x27;t need to transform your yard. You&#x27;ll need to smash the kids&#x27; electronic devices.","time":1525134049,"type":"comment"},
{"by":"_s","id":16963694,"parent":16963328,"retrieved_on":1528401061,"text":"&quot;Black Box&quot; car insurance already exists :)","time":1525134070,"type":"comment"},
{"by":"akoumis","descendants":0,"id":16963695,"retrieved_on":1528401061,"score":2,"time":1525134111,"title":"What is the best architecture for a YouTube downloader site?","type":"story","url":"https:\/\/stackoverflow.com\/questions\/50109863\/what-is-the-best-architecture-for-youtube-downloader-site"},
{"deleted":true,"id":16963696,"retrieved_on":1528401061,"time":1525134116,"type":"story"},
{"by":"emodendroket","id":16963697,"parent":16963610,"retrieved_on":1528401061,"text":"The incentives are aligned that way... once you&#x27;re big the biggest thing is protecting your position.","time":1525134117,"type":"comment"},
{"by":"tonyarkles","id":16963698,"parent":16963659,"retrieved_on":1528401061,"text":"Whenever this comes up, I’m reminded of two of my favourite calculators: the HP48 and the HP49g+. HP used a processor called the Saturn for a long time, and when they finally could no longer source it, they switched to ARM running a Saturn emulator for the ‘49. The ‘48 had battle-hardened firmware, and this was probably a great decision.<p><a href=\"https:&#x2F;&#x2F;en.m.wikipedia.org&#x2F;wiki&#x2F;HP_Saturn\" rel=\"nofollow\">https:&#x2F;&#x2F;en.m.wikipedia.org&#x2F;wiki&#x2F;HP_Saturn<\/a>","time":1525134162,"type":"comment"},
{"by":"gowld","id":16963699,"kids":[16964288],"parent":16961384,"retrieved_on":1528401061,"text":"Turning it around, what&#x27;s wrong with parking in a city garage, and reclaiming residential infrastructure that has been lately overrun with automobiles? Why give automobiles primacy over people -- Ford Prefect&#x27;s blunder?","time":1525134173,"type":"comment"},
{"by":"jeremyt","id":16963700,"parent":16963200,"retrieved_on":1528401061,"text":"There is evidence.<p><a href=\"https:&#x2F;&#x2F;examine.com&#x2F;supplements&#x2F;magnesium&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;examine.com&#x2F;supplements&#x2F;magnesium&#x2F;<\/a>","time":1525134177,"type":"comment"}]
